### DataFrame

In [1]:
import pandas as pd

In [8]:
data = { 
         'name' : ['AA', 'IBM', 'GOOG'],
         'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
         'shares' : [100, 30, 90],
         'price' : [12.3, 10.3, 32.2]
       }
data

{'name': ['AA', 'IBM', 'GOOG'],
 'date': ['2001-12-01', '2012-02-10', '2010-04-09'],
 'shares': [100, 30, 90],
 'price': [12.3, 10.3, 32.2]}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

##### Additional columns can be added after defning a DataFrame

In [11]:
df['owner'] = 'Unknown'
df

   name        date  shares  price    owner
0    AA  2001-12-01     100   12.3  Unknown
1   IBM  2012-02-10      30   10.3  Unknown
2  GOOG  2010-04-09      90   32.2  Unknown

##### Currently, the row index are set to 0, 1 and 2. These can be changed using ‘index’ attribute as below

In [12]:
df.index = ['one', 'two', 'three']
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  Unknown
two     IBM  2012-02-10      30   10.3  Unknown
three  GOOG  2010-04-09      90   32.2  Unknown

##### Any column of the DataFrame can be set as index using ‘set_index()’ attribut

In [13]:
df = df.set_index(['name'])

In [14]:
df

            date  shares  price    owner
name
AA    2001-12-01     100   12.3  Unknown
IBM   2012-02-10      30   10.3  Unknown
GOOG  2010-04-09      90   32.2  Unknown

##### Data can be accessed in two ways i.e. using row and column index

Accessing data using column-index

In [15]:
df['price']

name
AA      12.3
IBM     10.3
GOOG    32.2
Name: price, dtype: float64

##### Accessing data using row-index

In [19]:
df.loc['AA']

date      2001-12-01
shares           100
price           12.3
owner        Unknown
Name: AA, dtype: object

##### Access all rows for a column

In [23]:
df.loc[:, 'date']

name
AA      2001-12-01
IBM     2012-02-10
GOOG    2010-04-09
Name: date, dtype: object

In [25]:
df.loc[:, 'shares']   #[row , column]

name
AA      100
IBM      30
GOOG     90
Name: shares, dtype: int64

#####  Any column can be deleted using ‘del’ or ‘drop’ commands

In [26]:
del df['owner']

In [27]:
df

            date  shares  price
name
AA    2001-12-01     100   12.3
IBM   2012-02-10      30   10.3
GOOG  2010-04-09      90   32.2

In [28]:
df.drop('shares', axis = 1)

            date  price
name
AA    2001-12-01   12.3
IBM   2012-02-10   10.3
GOOG  2010-04-09   32.2